tutorials/incompressible/bump/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

7
(
    bump
    {
        type            wall;
        inGroups        1(wall);
        nFaces          10;
        startFace       560;
    }
    outlet
    {
        type            outlet;
        nFaces          10;
        startFace       570;
    }
    inlet
    {
        type            inlet;
        nFaces          10;
        startFace       580;
    }
    side1
    {
        type            empty;
        inGroups        1(empty);
        nFaces          300;
        startFace       590;
    }
    side2
    {
        type            empty;
        inGroups        1(empty);
        nFaces          300;
        startFace       890;
    }
    symmetry
    {
        type            symmetry;
        inGroups        1(symmetry);
        nFaces          20;
        startFace       1190;
    }
    top
    {
        type            symmetry;
        inGroups        1(symmetry);
        nFaces          30;
        startFace       1210;
    }
)

// ************************************************************************* //
